zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl702x-pinctrl.h
/*
 * Autogenerated file
 * Copyright (c) 2026 BFLB Pinctrl Generator <nandojve@gmail.com>
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef DT_BINDINGS_PINCTRL_BFLB_BL702X_PINCTRL_H_
#define DT_BINDINGS_PINCTRL_BFLB_BL702X_PINCTRL_H_

#include <dt-bindings/pinctrl/bl70x-pinctrl.h>
#include <dt-bindings/pinctrl/bflb-common-pinctrl.h>

/* gpio0_clock_out0_i2s_ref */
#define GPIO0_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(0, clock_out0, i2s_ref, periph)

/* gpio0_clock_out0_aupll */
#define GPIO0_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(0, clock_out0, aupll, periph)

/* gpio0_clock_out0_xtal */
#define GPIO0_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(0, clock_out0, xtal, periph)

/* gpio0_i2s_blck */
#define GPIO0_I2S_BLCK \
	BFLB_PINMUX(0, i2s, blck, periph)

/* gpio0_spi_mosi */
#define GPIO0_SPI_MOSI \
	BFLB_PINMUX(0, spi, mosi, periph)

/* gpio0_i2c_scl */
#define GPIO0_I2C_SCL \
	BFLB_PINMUX(0, i2c, scl, periph)

/* gpio0_uart0_rts */
#define GPIO0_UART0_RTS \
	BFLB_PINMUX(0, uart0, rts, periph)

/* gpio0_uart0_cts */
#define GPIO0_UART0_CTS \
	BFLB_PINMUX(0, uart0, cts, periph)

/* gpio0_uart0_tx */
#define GPIO0_UART0_TX \
	BFLB_PINMUX(0, uart0, tx, periph)

/* gpio0_uart0_rx */
#define GPIO0_UART0_RX \
	BFLB_PINMUX(0, uart0, rx, periph)

/* gpio0_uart1_rts */
#define GPIO0_UART1_RTS \
	BFLB_PINMUX(0, uart1, rts, periph)

/* gpio0_uart1_cts */
#define GPIO0_UART1_CTS \
	BFLB_PINMUX(0, uart1, cts, periph)

/* gpio0_uart1_tx */
#define GPIO0_UART1_TX \
	BFLB_PINMUX(0, uart1, tx, periph)

/* gpio0_uart1_rx */
#define GPIO0_UART1_RX \
	BFLB_PINMUX(0, uart1, rx, periph)

/* gpio0_pwm_ch0 */
#define GPIO0_PWM_CH0 \
	BFLB_PINMUX(0, pwm, ch0, periph)

/* gpio0_cam_pix_clk */
#define GPIO0_CAM_PIX_CLK \
	BFLB_PINMUX(0, cam, pix_clk, periph)

/* gpio0_jtag_tms */
#define GPIO0_JTAG_TMS \
	BFLB_PINMUX(0, jtag, tms, periph)

/* gpio0_fem_gpio0 */
#define GPIO0_FEM_GPIO0 \
	BFLB_PINMUX(0, fem, gpio0, periph)

/* gpio0_mii_ref_clk */
#define GPIO0_MII_REF_CLK \
	BFLB_PINMUX(0, mii, ref_clk, periph)

/* gpio0_qdec0_a */
#define GPIO0_QDEC0_A \
	BFLB_PINMUX(0, qdec0, a, periph)

/* gpio1_clock_out1_i2s_ref */
#define GPIO1_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(1, clock_out1, i2s_ref, periph)

/* gpio1_clock_out1_aupll */
#define GPIO1_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(1, clock_out1, aupll, periph)

/* gpio1_clock_out1_xtal */
#define GPIO1_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(1, clock_out1, xtal, periph)

/* gpio1_i2s_fs */
#define GPIO1_I2S_FS \
	BFLB_PINMUX(1, i2s, fs, periph)

/* gpio1_spi_miso */
#define GPIO1_SPI_MISO \
	BFLB_PINMUX(1, spi, miso, periph)

/* gpio1_i2c_sda */
#define GPIO1_I2C_SDA \
	BFLB_PINMUX(1, i2c, sda, periph)

/* gpio1_uart0_rts */
#define GPIO1_UART0_RTS \
	BFLB_PINMUX(1, uart0, rts, periph)

/* gpio1_uart0_cts */
#define GPIO1_UART0_CTS \
	BFLB_PINMUX(1, uart0, cts, periph)

/* gpio1_uart0_tx */
#define GPIO1_UART0_TX \
	BFLB_PINMUX(1, uart0, tx, periph)

/* gpio1_uart0_rx */
#define GPIO1_UART0_RX \
	BFLB_PINMUX(1, uart0, rx, periph)

/* gpio1_uart1_rts */
#define GPIO1_UART1_RTS \
	BFLB_PINMUX(1, uart1, rts, periph)

/* gpio1_uart1_cts */
#define GPIO1_UART1_CTS \
	BFLB_PINMUX(1, uart1, cts, periph)

/* gpio1_uart1_tx */
#define GPIO1_UART1_TX \
	BFLB_PINMUX(1, uart1, tx, periph)

/* gpio1_uart1_rx */
#define GPIO1_UART1_RX \
	BFLB_PINMUX(1, uart1, rx, periph)

/* gpio1_pwm_ch1 */
#define GPIO1_PWM_CH1 \
	BFLB_PINMUX(1, pwm, ch1, periph)

/* gpio1_cam_frame_vld */
#define GPIO1_CAM_FRAME_VLD \
	BFLB_PINMUX(1, cam, frame_vld, periph)

/* gpio1_jtag_tdi */
#define GPIO1_JTAG_TDI \
	BFLB_PINMUX(1, jtag, tdi, periph)

/* gpio1_fem_gpio1 */
#define GPIO1_FEM_GPIO1 \
	BFLB_PINMUX(1, fem, gpio1, periph)

/* gpio1_mii_txd0 */
#define GPIO1_MII_TXD0 \
	BFLB_PINMUX(1, mii, txd0, periph)

/* gpio1_qdec0_b */
#define GPIO1_QDEC0_B \
	BFLB_PINMUX(1, qdec0, b, periph)

/* gpio2_clock_out0_i2s_ref */
#define GPIO2_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(2, clock_out0, i2s_ref, periph)

/* gpio2_clock_out0_aupll */
#define GPIO2_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(2, clock_out0, aupll, periph)

/* gpio2_clock_out0_xtal */
#define GPIO2_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(2, clock_out0, xtal, periph)

/* gpio2_i2s_do */
#define GPIO2_I2S_DO \
	BFLB_PINMUX(2, i2s, do, periph)

/* gpio2_spi_ss */
#define GPIO2_SPI_SS \
	BFLB_PINMUX(2, spi, ss, periph)

/* gpio2_i2c_scl */
#define GPIO2_I2C_SCL \
	BFLB_PINMUX(2, i2c, scl, periph)

/* gpio2_uart0_rts */
#define GPIO2_UART0_RTS \
	BFLB_PINMUX(2, uart0, rts, periph)

/* gpio2_uart0_cts */
#define GPIO2_UART0_CTS \
	BFLB_PINMUX(2, uart0, cts, periph)

/* gpio2_uart0_tx */
#define GPIO2_UART0_TX \
	BFLB_PINMUX(2, uart0, tx, periph)

/* gpio2_uart0_rx */
#define GPIO2_UART0_RX \
	BFLB_PINMUX(2, uart0, rx, periph)

/* gpio2_uart1_rts */
#define GPIO2_UART1_RTS \
	BFLB_PINMUX(2, uart1, rts, periph)

/* gpio2_uart1_cts */
#define GPIO2_UART1_CTS \
	BFLB_PINMUX(2, uart1, cts, periph)

/* gpio2_uart1_tx */
#define GPIO2_UART1_TX \
	BFLB_PINMUX(2, uart1, tx, periph)

/* gpio2_uart1_rx */
#define GPIO2_UART1_RX \
	BFLB_PINMUX(2, uart1, rx, periph)

/* gpio2_pwm_ch2 */
#define GPIO2_PWM_CH2 \
	BFLB_PINMUX(2, pwm, ch2, periph)

/* gpio2_cam_line_vld */
#define GPIO2_CAM_LINE_VLD \
	BFLB_PINMUX(2, cam, line_vld, periph)

/* gpio2_jtag_tck */
#define GPIO2_JTAG_TCK \
	BFLB_PINMUX(2, jtag, tck, periph)

/* gpio2_fem_gpio2 */
#define GPIO2_FEM_GPIO2 \
	BFLB_PINMUX(2, fem, gpio2, periph)

/* gpio2_mii_txd1 */
#define GPIO2_MII_TXD1 \
	BFLB_PINMUX(2, mii, txd1, periph)

/* gpio2_qdec0_led */
#define GPIO2_QDEC0_LED \
	BFLB_PINMUX(2, qdec0, led, periph)

/* gpio7_clock_out1_i2s_ref */
#define GPIO7_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(7, clock_out1, i2s_ref, periph)

/* gpio7_clock_out1_aupll */
#define GPIO7_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(7, clock_out1, aupll, periph)

/* gpio7_clock_out1_xtal */
#define GPIO7_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(7, clock_out1, xtal, periph)

/* gpio7_i2s_di */
#define GPIO7_I2S_DI \
	BFLB_PINMUX(7, i2s, di, periph)

/* gpio7_spi_sclk */
#define GPIO7_SPI_SCLK \
	BFLB_PINMUX(7, spi, sclk, periph)

