zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl702x-pinctrl.h
/* gpio7_i2c_sda */
#define GPIO7_I2C_SDA \
	BFLB_PINMUX(7, i2c, sda, periph)

/* gpio7_uart0_rts */
#define GPIO7_UART0_RTS \
	BFLB_PINMUX(7, uart0, rts, periph)

/* gpio7_uart0_cts */
#define GPIO7_UART0_CTS \
	BFLB_PINMUX(7, uart0, cts, periph)

/* gpio7_uart0_tx */
#define GPIO7_UART0_TX \
	BFLB_PINMUX(7, uart0, tx, periph)

/* gpio7_uart0_rx */
#define GPIO7_UART0_RX \
	BFLB_PINMUX(7, uart0, rx, periph)

/* gpio7_uart1_rts */
#define GPIO7_UART1_RTS \
	BFLB_PINMUX(7, uart1, rts, periph)

/* gpio7_uart1_cts */
#define GPIO7_UART1_CTS \
	BFLB_PINMUX(7, uart1, cts, periph)

/* gpio7_uart1_tx */
#define GPIO7_UART1_TX \
	BFLB_PINMUX(7, uart1, tx, periph)

/* gpio7_uart1_rx */
#define GPIO7_UART1_RX \
	BFLB_PINMUX(7, uart1, rx, periph)

/* gpio7_pwm_ch2 */
#define GPIO7_PWM_CH2 \
	BFLB_PINMUX(7, pwm, ch2, periph)

/* gpio7_jtag_tdo */
#define GPIO7_JTAG_TDO \
	BFLB_PINMUX(7, jtag, tdo, periph)

/* gpio7_fem_gpio2 */
#define GPIO7_FEM_GPIO2 \
	BFLB_PINMUX(7, fem, gpio2, periph)

/* gpio7_mii_rxd0 */
#define GPIO7_MII_RXD0 \
	BFLB_PINMUX(7, mii, rxd0, periph)

/* gpio7_qdec2_b */
#define GPIO7_QDEC2_B \
	BFLB_PINMUX(7, qdec2, b, periph)

/* gpio7_adc_ch6 */
#define GPIO7_ADC_CH6 \
	BFLB_PINMUX(7, adc, ch6, analog)

/* gpio7_usb_dp */
#define GPIO7_USB_DP \
	BFLB_PINMUX(7, usb, dp, analog)

/* gpio8_clock_out0_i2s_ref */
#define GPIO8_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(8, clock_out0, i2s_ref, periph)

/* gpio8_clock_out0_aupll */
#define GPIO8_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(8, clock_out0, aupll, periph)

/* gpio8_clock_out0_xtal */
#define GPIO8_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(8, clock_out0, xtal, periph)

/* gpio8_i2s_bclk */
#define GPIO8_I2S_BCLK \
	BFLB_PINMUX(8, i2s, bclk, periph)

/* gpio8_spi_mosi */
#define GPIO8_SPI_MOSI \
	BFLB_PINMUX(8, spi, mosi, periph)

/* gpio8_i2c_scl */
#define GPIO8_I2C_SCL \
	BFLB_PINMUX(8, i2c, scl, periph)

/* gpio8_uart0_rts */
#define GPIO8_UART0_RTS \
	BFLB_PINMUX(8, uart0, rts, periph)

/* gpio8_uart0_cts */
#define GPIO8_UART0_CTS \
	BFLB_PINMUX(8, uart0, cts, periph)

/* gpio8_uart0_tx */
#define GPIO8_UART0_TX \
	BFLB_PINMUX(8, uart0, tx, periph)

/* gpio8_uart0_rx */
#define GPIO8_UART0_RX \
	BFLB_PINMUX(8, uart0, rx, periph)

/* gpio8_uart1_rts */
#define GPIO8_UART1_RTS \
	BFLB_PINMUX(8, uart1, rts, periph)

/* gpio8_uart1_cts */
#define GPIO8_UART1_CTS \
	BFLB_PINMUX(8, uart1, cts, periph)

/* gpio8_uart1_tx */
#define GPIO8_UART1_TX \
	BFLB_PINMUX(8, uart1, tx, periph)

/* gpio8_uart1_rx */
#define GPIO8_UART1_RX \
	BFLB_PINMUX(8, uart1, rx, periph)

/* gpio8_pwm_ch3 */
#define GPIO8_PWM_CH3 \
	BFLB_PINMUX(8, pwm, ch3, periph)

/* gpio8_jtag_tms */
#define GPIO8_JTAG_TMS \
	BFLB_PINMUX(8, jtag, tms, periph)

/* gpio8_fem_gpio3 */
#define GPIO8_FEM_GPIO3 \
	BFLB_PINMUX(8, fem, gpio3, periph)

/* gpio8_mii_rxd1 */
#define GPIO8_MII_RXD1 \
	BFLB_PINMUX(8, mii, rxd1, periph)

/* gpio8_qdec2_led */
#define GPIO8_QDEC2_LED \
	BFLB_PINMUX(8, qdec2, led, periph)

/* gpio8_adc_ch0 */
#define GPIO8_ADC_CH0 \
	BFLB_PINMUX(8, adc, ch0, analog)

/* gpio8_usb_dm */
#define GPIO8_USB_DM \
	BFLB_PINMUX(8, usb, dm, analog)

/* gpio9_clock_out1_i2s_ref */
#define GPIO9_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(9, clock_out1, i2s_ref, periph)

/* gpio9_clock_out1_aupll */
#define GPIO9_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(9, clock_out1, aupll, periph)

/* gpio9_clock_out1_xtal */
#define GPIO9_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(9, clock_out1, xtal, periph)

/* gpio9_i2s_fs */
#define GPIO9_I2S_FS \
	BFLB_PINMUX(9, i2s, fs, periph)

/* gpio9_spi_miso */
#define GPIO9_SPI_MISO \
	BFLB_PINMUX(9, spi, miso, periph)

/* gpio9_i2c_sda */
#define GPIO9_I2C_SDA \
	BFLB_PINMUX(9, i2c, sda, periph)

/* gpio9_uart0_rts */
#define GPIO9_UART0_RTS \
	BFLB_PINMUX(9, uart0, rts, periph)

/* gpio9_uart0_cts */
#define GPIO9_UART0_CTS \
	BFLB_PINMUX(9, uart0, cts, periph)

/* gpio9_uart0_tx */
#define GPIO9_UART0_TX \
	BFLB_PINMUX(9, uart0, tx, periph)

/* gpio9_uart0_rx */
#define GPIO9_UART0_RX \
	BFLB_PINMUX(9, uart0, rx, periph)

/* gpio9_uart1_rts */
#define GPIO9_UART1_RTS \
	BFLB_PINMUX(9, uart1, rts, periph)

/* gpio9_uart1_cts */
#define GPIO9_UART1_CTS \
	BFLB_PINMUX(9, uart1, cts, periph)

/* gpio9_uart1_tx */
#define GPIO9_UART1_TX \
	BFLB_PINMUX(9, uart1, tx, periph)

/* gpio9_uart1_rx */
#define GPIO9_UART1_RX \
	BFLB_PINMUX(9, uart1, rx, periph)

/* gpio9_pwm_ch4 */
#define GPIO9_PWM_CH4 \
	BFLB_PINMUX(9, pwm, ch4, periph)

/* gpio9_jtag_tdi */
#define GPIO9_JTAG_TDI \
	BFLB_PINMUX(9, jtag, tdi, periph)

/* gpio9_fem_gpio4 */
#define GPIO9_FEM_GPIO4 \
	BFLB_PINMUX(9, fem, gpio4, periph)

/* gpio9_qdec0_a */
#define GPIO9_QDEC0_A \
	BFLB_PINMUX(9, qdec0, a, periph)

/* gpio9_adc_ch7 */
#define GPIO9_ADC_CH7 \
	BFLB_PINMUX(9, adc, ch7, analog)

/* gpio14_clock_out0_i2s_ref */
#define GPIO14_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(14, clock_out0, i2s_ref, periph)

/* gpio14_clock_out0_aupll */
#define GPIO14_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(14, clock_out0, aupll, periph)

/* gpio14_clock_out0_xtal */
#define GPIO14_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(14, clock_out0, xtal, periph)

/* gpio14_i2s_do */
#define GPIO14_I2S_DO \
	BFLB_PINMUX(14, i2s, do, periph)

/* gpio14_spi_ss */
#define GPIO14_SPI_SS \
	BFLB_PINMUX(14, spi, ss, periph)

/* gpio14_i2c_scl */
#define GPIO14_I2C_SCL \
	BFLB_PINMUX(14, i2c, scl, periph)

/* gpio14_uart0_rts */
#define GPIO14_UART0_RTS \
	BFLB_PINMUX(14, uart0, rts, periph)

/* gpio14_uart0_cts */
#define GPIO14_UART0_CTS \
	BFLB_PINMUX(14, uart0, cts, periph)

/* gpio14_uart0_tx */
#define GPIO14_UART0_TX \
	BFLB_PINMUX(14, uart0, tx, periph)

/* gpio14_uart0_rx */
#define GPIO14_UART0_RX \
	BFLB_PINMUX(14, uart0, rx, periph)

/* gpio14_uart1_rts */
#define GPIO14_UART1_RTS \
	BFLB_PINMUX(14, uart1, rts, periph)

/* gpio14_uart1_cts */
#define GPIO14_UART1_CTS \
	BFLB_PINMUX(14, uart1, cts, periph)

/* gpio14_uart1_tx */
#define GPIO14_UART1_TX \
	BFLB_PINMUX(14, uart1, tx, periph)

/* gpio14_uart1_rx */
#define GPIO14_UART1_RX \
	BFLB_PINMUX(14, uart1, rx, periph)

