zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl702x-pinctrl.h
/* gpio14_pwm_ch4 */
#define GPIO14_PWM_CH4 \
	BFLB_PINMUX(14, pwm, ch4, periph)

/* gpio14_jtag_tck */
#define GPIO14_JTAG_TCK \
	BFLB_PINMUX(14, jtag, tck, periph)

/* gpio14_fem_gpio4 */
#define GPIO14_FEM_GPIO4 \
	BFLB_PINMUX(14, fem, gpio4, periph)

/* gpio14_qdec1_led */
#define GPIO14_QDEC1_LED \
	BFLB_PINMUX(14, qdec1, led, periph)

/* gpio14_adc_ch5 */
#define GPIO14_ADC_CH5 \
	BFLB_PINMUX(14, adc, ch5, analog)

/* gpio14_atest_out0 */
#define GPIO14_ATEST_OUT0 \
	BFLB_PINMUX(14, atest, out0, analog)

/* gpio15_clock_out1_i2s_ref */
#define GPIO15_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(15, clock_out1, i2s_ref, periph)

/* gpio15_clock_out1_aupll */
#define GPIO15_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(15, clock_out1, aupll, periph)

/* gpio15_clock_out1_xtal */
#define GPIO15_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(15, clock_out1, xtal, periph)

/* gpio15_i2s_di */
#define GPIO15_I2S_DI \
	BFLB_PINMUX(15, i2s, di, periph)

/* gpio15_spi_sclk */
#define GPIO15_SPI_SCLK \
	BFLB_PINMUX(15, spi, sclk, periph)

/* gpio15_i2c_sda */
#define GPIO15_I2C_SDA \
	BFLB_PINMUX(15, i2c, sda, periph)

/* gpio15_uart0_rts */
#define GPIO15_UART0_RTS \
	BFLB_PINMUX(15, uart0, rts, periph)

/* gpio15_uart0_cts */
#define GPIO15_UART0_CTS \
	BFLB_PINMUX(15, uart0, cts, periph)

/* gpio15_uart0_tx */
#define GPIO15_UART0_TX \
	BFLB_PINMUX(15, uart0, tx, periph)

/* gpio15_uart0_rx */
#define GPIO15_UART0_RX \
	BFLB_PINMUX(15, uart0, rx, periph)

/* gpio15_uart1_rts */
#define GPIO15_UART1_RTS \
	BFLB_PINMUX(15, uart1, rts, periph)

/* gpio15_uart1_cts */
#define GPIO15_UART1_CTS \
	BFLB_PINMUX(15, uart1, cts, periph)

/* gpio15_uart1_tx */
#define GPIO15_UART1_TX \
	BFLB_PINMUX(15, uart1, tx, periph)

/* gpio15_uart1_rx */
#define GPIO15_UART1_RX \
	BFLB_PINMUX(15, uart1, rx, periph)

/* gpio15_pwm_ch0 */
#define GPIO15_PWM_CH0 \
	BFLB_PINMUX(15, pwm, ch0, periph)

/* gpio15_jtag_tdo */
#define GPIO15_JTAG_TDO \
	BFLB_PINMUX(15, jtag, tdo, periph)

/* gpio15_fem_gpio0 */
#define GPIO15_FEM_GPIO0 \
	BFLB_PINMUX(15, fem, gpio0, periph)

/* gpio15_qdec2_a */
#define GPIO15_QDEC2_A \
	BFLB_PINMUX(15, qdec2, a, periph)

/* gpio15_adc_ch1 */
#define GPIO15_ADC_CH1 \
	BFLB_PINMUX(15, adc, ch1, analog)

/* gpio15_atest_out1 */
#define GPIO15_ATEST_OUT1 \
	BFLB_PINMUX(15, atest, out1, analog)

/* gpio17_clock_out1_i2s_ref */
#define GPIO17_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(17, clock_out1, i2s_ref, periph)

/* gpio17_clock_out1_aupll */
#define GPIO17_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(17, clock_out1, aupll, periph)

/* gpio17_clock_out1_xtal */
#define GPIO17_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(17, clock_out1, xtal, periph)

/* gpio17_sf1_d0 */
#define GPIO17_SF1_D0 \
	BFLB_PINMUX(17, sf1, d0, periph)

/* gpio17_sf2_cs2 */
#define GPIO17_SF2_CS2 \
	BFLB_PINMUX(17, sf2, cs2, periph)

/* gpio17_i2s_fs */
#define GPIO17_I2S_FS \
	BFLB_PINMUX(17, i2s, fs, periph)

/* gpio17_spi_miso */
#define GPIO17_SPI_MISO \
	BFLB_PINMUX(17, spi, miso, periph)

/* gpio17_i2c_sda */
#define GPIO17_I2C_SDA \
	BFLB_PINMUX(17, i2c, sda, periph)

/* gpio17_uart0_rts */
#define GPIO17_UART0_RTS \
	BFLB_PINMUX(17, uart0, rts, periph)

/* gpio17_uart0_cts */
#define GPIO17_UART0_CTS \
	BFLB_PINMUX(17, uart0, cts, periph)

/* gpio17_uart0_tx */
#define GPIO17_UART0_TX \
	BFLB_PINMUX(17, uart0, tx, periph)

/* gpio17_uart0_rx */
#define GPIO17_UART0_RX \
	BFLB_PINMUX(17, uart0, rx, periph)

/* gpio17_uart1_rts */
#define GPIO17_UART1_RTS \
	BFLB_PINMUX(17, uart1, rts, periph)

/* gpio17_uart1_cts */
#define GPIO17_UART1_CTS \
	BFLB_PINMUX(17, uart1, cts, periph)

/* gpio17_uart1_tx */
#define GPIO17_UART1_TX \
	BFLB_PINMUX(17, uart1, tx, periph)

/* gpio17_uart1_rx */
#define GPIO17_UART1_RX \
	BFLB_PINMUX(17, uart1, rx, periph)

/* gpio17_pwm_ch2 */
#define GPIO17_PWM_CH2 \
	BFLB_PINMUX(17, pwm, ch2, periph)

/* gpio17_jtag_tdi */
#define GPIO17_JTAG_TDI \
	BFLB_PINMUX(17, jtag, tdi, periph)

/* gpio17_fem_gpio2 */
#define GPIO17_FEM_GPIO2 \
	BFLB_PINMUX(17, fem, gpio2, periph)

/* gpio17_qdec2_led */
#define GPIO17_QDEC2_LED \
	BFLB_PINMUX(17, qdec2, led, periph)

/* gpio17_adc_ch2 */
#define GPIO17_ADC_CH2 \
	BFLB_PINMUX(17, adc, ch2, analog)

/* gpio17_dac_chb */
#define GPIO17_DAC_CHB \
	BFLB_PINMUX(17, dac, chb, analog)

/* gpio23_clock_out1_i2s_ref */
#define GPIO23_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(23, clock_out1, i2s_ref, periph)

/* gpio23_clock_out1_aupll */
#define GPIO23_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(23, clock_out1, aupll, periph)

/* gpio23_clock_out1_xtal */
#define GPIO23_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(23, clock_out1, xtal, periph)

/* gpio23_sf2_d2 */
#define GPIO23_SF2_D2 \
	BFLB_PINMUX(23, sf2, d2, periph)

/* gpio23_sf2_cs */
#define GPIO23_SF2_CS \
	BFLB_PINMUX(23, sf2, cs, periph)

/* gpio23_sf3_cs2 */
#define GPIO23_SF3_CS2 \
	BFLB_PINMUX(23, sf3, cs2, periph)

/* gpio23_i2s_di */
#define GPIO23_I2S_DI \
	BFLB_PINMUX(23, i2s, di, periph)

/* gpio23_spi_sclk */
#define GPIO23_SPI_SCLK \
	BFLB_PINMUX(23, spi, sclk, periph)

/* gpio23_i2c_sda */
#define GPIO23_I2C_SDA \
	BFLB_PINMUX(23, i2c, sda, periph)

/* gpio23_uart0_rts */
#define GPIO23_UART0_RTS \
	BFLB_PINMUX(23, uart0, rts, periph)

/* gpio23_uart0_cts */
#define GPIO23_UART0_CTS \
	BFLB_PINMUX(23, uart0, cts, periph)

/* gpio23_uart0_tx */
#define GPIO23_UART0_TX \
	BFLB_PINMUX(23, uart0, tx, periph)

/* gpio23_uart0_rx */
#define GPIO23_UART0_RX \
	BFLB_PINMUX(23, uart0, rx, periph)

/* gpio23_uart1_rts */
#define GPIO23_UART1_RTS \
	BFLB_PINMUX(23, uart1, rts, periph)

/* gpio23_uart1_cts */
#define GPIO23_UART1_CTS \
	BFLB_PINMUX(23, uart1, cts, periph)

/* gpio23_uart1_tx */
#define GPIO23_UART1_TX \
	BFLB_PINMUX(23, uart1, tx, periph)

/* gpio23_uart1_rx */
#define GPIO23_UART1_RX \
	BFLB_PINMUX(23, uart1, rx, periph)

/* gpio23_pwm_ch3 */
#define GPIO23_PWM_CH3 \
	BFLB_PINMUX(23, pwm, ch3, periph)

/* gpio23_cam_pix_dat4 */
#define GPIO23_CAM_PIX_DAT4 \
	BFLB_PINMUX(23, cam, pix_dat4, periph)

/* gpio23_jtag_tdo */
#define GPIO23_JTAG_TDO \
	BFLB_PINMUX(23, jtag, tdo, periph)

/* gpio23_fem_gpio3 */
#define GPIO23_FEM_GPIO3 \
	BFLB_PINMUX(23, fem, gpio3, periph)

/* gpio23_qdec1_led */
#define GPIO23_QDEC1_LED \
	BFLB_PINMUX(23, qdec1, led, periph)

