zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl702x-pinctrl.h
/* gpio27_i2c_sda */
#define GPIO27_I2C_SDA \
	BFLB_PINMUX(27, i2c, sda, periph)

/* gpio27_uart0_rts */
#define GPIO27_UART0_RTS \
	BFLB_PINMUX(27, uart0, rts, periph)

/* gpio27_uart0_cts */
#define GPIO27_UART0_CTS \
	BFLB_PINMUX(27, uart0, cts, periph)

/* gpio27_uart0_tx */
#define GPIO27_UART0_TX \
	BFLB_PINMUX(27, uart0, tx, periph)

/* gpio27_uart0_rx */
#define GPIO27_UART0_RX \
	BFLB_PINMUX(27, uart0, rx, periph)

/* gpio27_uart1_rts */
#define GPIO27_UART1_RTS \
	BFLB_PINMUX(27, uart1, rts, periph)

/* gpio27_uart1_cts */
#define GPIO27_UART1_CTS \
	BFLB_PINMUX(27, uart1, cts, periph)

/* gpio27_uart1_tx */
#define GPIO27_UART1_TX \
	BFLB_PINMUX(27, uart1, tx, periph)

/* gpio27_uart1_rx */
#define GPIO27_UART1_RX \
	BFLB_PINMUX(27, uart1, rx, periph)

/* gpio27_pwm_ch2 */
#define GPIO27_PWM_CH2 \
	BFLB_PINMUX(27, pwm, ch2, periph)

/* gpio27_jtag_tdo */
#define GPIO27_JTAG_TDO \
	BFLB_PINMUX(27, jtag, tdo, periph)

/* gpio27_fem_gpio2 */
#define GPIO27_FEM_GPIO2 \
	BFLB_PINMUX(27, fem, gpio2, periph)

/* gpio27_mii_tx_en */
#define GPIO27_MII_TX_EN \
	BFLB_PINMUX(27, mii, tx_en, periph)

/* gpio27_qdec0_a */
#define GPIO27_QDEC0_A \
	BFLB_PINMUX(27, qdec0, a, periph)

/* gpio28_clock_out0_i2s_ref */
#define GPIO28_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(28, clock_out0, i2s_ref, periph)

/* gpio28_clock_out0_aupll */
#define GPIO28_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(28, clock_out0, aupll, periph)

/* gpio28_clock_out0_xtal */
#define GPIO28_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(28, clock_out0, xtal, periph)

/* gpio28_sf2_d0 */
#define GPIO28_SF2_D0 \
	BFLB_PINMUX(28, sf2, d0, periph)

/* gpio28_sf2_d3 */
#define GPIO28_SF2_D3 \
	BFLB_PINMUX(28, sf2, d3, periph)

/* gpio28_i2s_bclk */
#define GPIO28_I2S_BCLK \
	BFLB_PINMUX(28, i2s, bclk, periph)

/* gpio28_spi_mosi */
#define GPIO28_SPI_MOSI \
	BFLB_PINMUX(28, spi, mosi, periph)

/* gpio28_i2c_scl */
#define GPIO28_I2C_SCL \
	BFLB_PINMUX(28, i2c, scl, periph)

/* gpio28_uart0_rts */
#define GPIO28_UART0_RTS \
	BFLB_PINMUX(28, uart0, rts, periph)

/* gpio28_uart0_cts */
#define GPIO28_UART0_CTS \
	BFLB_PINMUX(28, uart0, cts, periph)

/* gpio28_uart0_tx */
#define GPIO28_UART0_TX \
	BFLB_PINMUX(28, uart0, tx, periph)

/* gpio28_uart0_rx */
#define GPIO28_UART0_RX \
	BFLB_PINMUX(28, uart0, rx, periph)

/* gpio28_uart1_rts */
#define GPIO28_UART1_RTS \
	BFLB_PINMUX(28, uart1, rts, periph)

/* gpio28_uart1_cts */
#define GPIO28_UART1_CTS \
	BFLB_PINMUX(28, uart1, cts, periph)

/* gpio28_uart1_tx */
#define GPIO28_UART1_TX \
	BFLB_PINMUX(28, uart1, tx, periph)

/* gpio28_uart1_rx */
#define GPIO28_UART1_RX \
	BFLB_PINMUX(28, uart1, rx, periph)

/* gpio28_pwm_ch3 */
#define GPIO28_PWM_CH3 \
	BFLB_PINMUX(28, pwm, ch3, periph)

/* gpio28_cam_pix_dat4 */
#define GPIO28_CAM_PIX_DAT4 \
	BFLB_PINMUX(28, cam, pix_dat4, periph)

/* gpio28_jtag_tms */
#define GPIO28_JTAG_TMS \
	BFLB_PINMUX(28, jtag, tms, periph)

/* gpio28_fem_gpio3 */
#define GPIO28_FEM_GPIO3 \
	BFLB_PINMUX(28, fem, gpio3, periph)

/* gpio28_mii_rx_dv */
#define GPIO28_MII_RX_DV \
	BFLB_PINMUX(28, mii, rx_dv, periph)

/* gpio28_qdec0_b */
#define GPIO28_QDEC0_B \
	BFLB_PINMUX(28, qdec0, b, periph)

#endif /* DT_BINDINGS_PINCTRL_BFLB_BL702X_PINCTRL_H_ */
